applications/solvers/dbs_reactiveThermalFoam/runs/reactiveThermalValidations/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e6;

boundaryField
{
    // inlet
    // {
    //     type            fixedFluxPressure;
    //     value           $internalField;
    // }

    // outlet
    // {
    //     type            fixedValue;
    //     value           $internalField;
    //     p0              $internalField;
    // }

    // outlet
    // {
    //     type            fixedFluxPressure;
    //     value           $internalField;
    // }

    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
        p0              $internalField;
    }

    // outlet
    // {
    //     type            fixedValue;
    //     value           $internalField;
    // }

    // fixedWalls
    // {
    //     type            prghTotalPressure;
    //     p0              $internalField;
    //     value           $internalField;
    // }

    fixedWalls
    {
        type            fixedFluxPressure;
        p0              $internalField;
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
    
}

// ************************************************************************* //
